Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
            <instance name="OCMP7">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP8">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
            <instance name="OCMP9">
                <parameters>
                    <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                    <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
                    <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 6"/>
                    <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 7"/>
                 </parameters>
            </instance>
         </module>
         <module id="03088" name="PCACHE" version="">
            <instance name="PCACHE">
               <register-group address-space="periph_pb1_std" name="PCACHE" name-in-module="PCACHE" offset="0x1f800800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01494" name="QEI" version="">
           <instance name="QEI1">
              <register-group address-space="periph_pb2_std" name="QEI" name-in-module="QEI" offset="0x1f82b200" />
              <parameters>
                 <param name="" value=""/>
              </parameters>
           </instance>
           <instance name="QEI2">
              <parameters>
                 <param name="" value=""/>
              </parameters>
           </instance>
           <instance name="QEI3">
              <parameters>
                 <param name="" value=""/>
              </parameters>
           </instance>
         </module>
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02481" name="RPOR" version="">
            <instance name="RPOR">
               <register-group address-space="periph_pb1_std" name="RPOR" name-in-module="RPOR" offset="0x1f801600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx" name="SB" name-in-module="SB" offset="0x1f8f0510" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f827000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph_pb2_std" name="TMR1" name-in-module="TMR1" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02815" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph_pb2_std" name="TMR2" name-in-module="TMR2" offset="0x1f820200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR6">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR7">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR8">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR9">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph_pb2_std" name="UART" name-in-module="UART" offset="0x1f828000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
