Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="ADC Module Enable bit" name="ADCCON1__ON">
         <value caption="ADC module is enabled" name="" value="0x1" />
         <value caption="ADC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Scan Trigger Source Select bits" name="ADCCON1__STRGSRC">
         <value caption="PWM Generator 12 trigger" name="" value="0x1e" />
         <value caption="PWM Generator 11 trigger" name="" value="0x1d" />
         <value caption="PWM Generator 10 trigger" name="" value="0x1c" />
         <value caption="PWM Generator 4 Current-Limit (Motor Control only)" name="" value="0x1b" />
         <value caption="PWM Generator 3 Current-Limit (Motor Control only)" name="" value="0x1a" />
         <value caption="PWM Generator 2 Current-Limit (Motor Control only)" name="" value="0x19" />
         <value caption="PWM Generator 1 Current-Limit (Motor Control only)" name="" value="0x18" />
         <value caption="PWM Generator 9 trigger" name="" value="0x17" />
         <value caption="PWM Generator 8 trigger" name="" value="0x16" />
         <value caption="PWM Generator 7 trigger" name="" value="0x15" />
         <value caption="CTMU trip" name="" value="0x14" />
         <value caption="Output Compare 4 period end" name="" value="0x13" />
         <value caption="Output Compare 3 period end" name="" value="0x12" />
         <value caption="Output Compare 2 period end" name="" value="0x11" />
         <value caption="Output Compare 1 period end" name="" value="0x10" />
         <value caption="PWM Generator 6 trigger (Motor Control only)" name="" value="0xf" />
         <value caption="PWM Generator 5 trigger (Motor Control only)" name="" value="0xe" />
         <value caption="PWM Generator 4 trigger (Motor Control only)" name="" value="0xd" />
         <value caption="PWM Generator 3 trigger (Motor Control only)" name="" value="0xc" />
         <value caption="PWM Generator 2 trigger (Motor Control only)" name="" value="0xb" />
         <value caption="PWM Generator 1 trigger (Motor Control only)" name="" value="0xa" />
         <value caption="Secondary PWM time base (Motor Control only)" name="" value="0x9" />
         <value caption="Primary PWM time base (Motor Control only)" name="" value="0x8" />
         <value caption="General Purpose Timer5" name="" value="0x7" />
         <value caption="General Purpose Timer3" name="" value="0x6" />
         <value caption="General Purpose Timer1" name="" value="0x5" />
         <value caption="INT0" name="" value="0x4" />
         <value caption="Scan trigger" name="" value="0x3" />
         <value caption="Software level trigger" name="" value="0x2" />
         <value caption="Software edge trigger" name="" value="0x1" />
         <value caption="No Trigger" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC7 Resolution bits" name="ADCCON1__SELRES">
         <value caption="12 bits (default)" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Fractional Data Output Format bit" name="ADCCON1__FRACT">
         <value caption="Fractional" name="" value="0x1" />
         <value caption="Integer" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Clock Divider bits" name="ADCCON2__ADCDIV">
         <value caption="254 * Tq = Tad" name="" value="0x7f" />
         <value caption="6 * Tq = Tad" name="" value="0x3" />
         <value caption="4 * Tq = Tad" name="" value="0x2" />
         <value caption="2 * Tq = Tad" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Early Interrupt Select bits" name="ADCCON2__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC module clocks prior to end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC module clock prior to end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Request Override bit" name="ADCCON2__ADCEIOVR">
         <value caption="Early interrupt generation is overridden and interrupt generation is controlled by the ADCGIRQEN1 and ADCGIRQEN2 registers" name="" value="0x1" />
         <value caption="Early interrupt generation is not overridden and interrupt generation is controlled by the ADCEIEN1 and ADCEIEN2 registers" name="" value="0x0" />
      </value-group>
      <value-group caption="End of Scan Interrupt Enable bit" name="ADCCON2__EOSIEN">
         <value caption="Interrupt will be generated when EOSRDY bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the EOSRDY bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap/ Vref Voltage Fault Interrupt Enable bit" name="ADCCON2__REFFLTIEN">
         <value caption="Interrupt will be generated when the REFFLT bit is set" name="" value="0x1" />
         <value caption="No interrupt is generated when the REFFLT bit is set" name="" value="0x0" />
      </value-group>
