Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY35">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY36">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY37">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY38">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY39">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY40">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY41">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY45">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY46">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY47">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY48">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY49">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY50">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY51">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY52">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bits" name="ADCDSTAT2__ARDY53">
         <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1" />
         <value caption="This bit is cleared when the associated data register is read" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR1__CHNLID">
         <value caption="AN27 input" name="" value="0x1b" />
         <value caption="AN26 input" name="" value="0x1a" />
         <value caption="AN25 input" name="" value="0x19" />
         <value caption="AN24 input" name="" value="0x18" />
         <value caption="AN23 input" name="" value="0x17" />
         <value caption="AN22 input" name="" value="0x16" />
         <value caption="AN21 input" name="" value="0x15" />
         <value caption="AN20 input" name="" value="0x14" />
         <value caption="AN19 input" name="" value="0x13" />
         <value caption="AN18 input" name="" value="0x12" />
         <value caption="AN17 input" name="" value="0x11" />
         <value caption="AN16 input" name="" value="0x10" />
         <value caption="AN15 input" name="" value="0xf" />
         <value caption="AN14 input" name="" value="0xe" />
         <value caption="AN13 input" name="" value="0xd" />
         <value caption="AN12 input" name="" value="0xc" />
         <value caption="AN11 input" name="" value="0xb" />
         <value caption="AN10 input" name="" value="0xa" />
         <value caption="AN9 input" name="" value="0x9" />
         <value caption="AN8 input" name="" value="0x8" />
         <value caption="AN7 input" name="" value="0x7" />
         <value caption="AN6 input" name="" value="0x6" />
         <value caption="ADC5 Module" name="" value="0x5" />
         <value caption="ADC4 Module" name="" value="0x4" />
         <value caption="ADC3 Module" name="" value="0x3" />
         <value caption="ADC2 Module" name="" value="0x2" />
         <value caption="ADC1 Module" name="" value="0x1" />
         <value caption="ADC0 Module" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Data Ready Status bit" name="ADCFLTR1__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1" />
         <value caption="Data is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Digital Filter 'x' Interrupt Enable bit" name="ADCFLTR1__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1" />
         <value caption="Digital filter is disabled" name="" value="0x0" />
      </value-group>
