Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC0TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC1TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC1TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC1TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC1TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC1TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC2TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC2TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC2TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC2TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC2TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC3TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC3TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
