Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Buffer Channel Enable bit" name="ADC3TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC3TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC3TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC4TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC4TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC4TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC4TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC4TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Sample Time bits" name="ADC5TIME__SAMC">
         <value caption="1025 TADx" name="" value="0x3ff" />
         <value caption="3 TADx" name="" value="0x1" />
         <value caption="2 TADx" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Clock Divisor bits" name="ADC5TIME__ADCDIV">
         <value caption="254 * TQ = TADx" name="" value="0x7f" />
         <value caption="6 * TQ = TADx" name="" value="0x3" />
         <value caption="4 * TQ = TADx" name="" value="0x2" />
         <value caption="2 * TQ = TADx" name="" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Channel Enable bit" name="ADC5TIME__BCHEN">
         <value caption="ADC data saved in DMA system ram buffer when DMAEN (ADCDSTAT) = 1" name="" value="0x1" />
         <value caption="ADC data must be read by CPU from appropriate ADC result register" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Resolution Select bits" name="ADC5TIME__SELRES">
         <value caption="12 bits" name="" value="0x3" />
         <value caption="10 bits" name="" value="0x2" />
         <value caption="8 bits" name="" value="0x1" />
         <value caption="6 bits" name="" value="0x0" />
      </value-group>
      <value-group caption="ADCx Early Interrupt Select bits" name="ADC5TIME__ADCEIS">
         <value caption="The data ready interrupt is generated 8 ADC clocks prior to the end of conversion" name="" value="0x7" />
         <value caption="The data ready interrupt is generated 7 ADC clocks prior to the end of conversion" name="" value="0x6" />
         <value caption="The data ready interrupt is generated 6 ADC clocks prior to the end of conversion" name="" value="0x5" />
         <value caption="The data ready interrupt is generated 5 ADC clocks prior to the end of conversion" name="" value="0x4" />
         <value caption="The data ready interrupt is generated 4 ADC clocks prior to the end of conversion" name="" value="0x3" />
         <value caption="The data ready interrupt is generated 3 ADC clocks prior to the end of conversion" name="" value="0x2" />
         <value caption="The data ready interrupt is generated 2 ADC clocks prior to the end of conversion" name="" value="0x1" />
         <value caption="The data ready interrupt is generated 1 ADC clock prior to the end of conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt Enable for Analog Input bits" name="ADCEIEN1__EIEN0">
         <value caption="Early Interrupts are enabled for the selected analog input. The interrupt is generated after the early interrupt event occurs (indicated by the EIRDYx bit ('x' = 31-0) of the ADCEISTAT1 register)" name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
