Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="" name="CFD1FIFOSTA10" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA10" offset="0x340" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Registe" name="CFD1FIFOCON11" offset="0x350" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON11__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON11__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON11__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON11__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON11__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON11__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON11__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON11__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON11__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON11__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON11__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON11__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON11__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON11__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON11__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA11" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA11" offset="0x370" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON12" offset="0x380" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON12__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON12__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON12__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON12__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON12__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON12__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON12__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON12__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON12__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON12__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON12__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON12__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON12__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON12__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON12__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA12" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA12" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON13" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON13__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON13__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON13__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON13__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON13__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON13__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON13__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON13__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON13__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON13__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON13__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON13__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON13__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON13__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON13__PLSIZE" />
         </register>
