Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="" name="CFD1FIFOSTA13" offset="0x3c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA13" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON14" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON14__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON14__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON14__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON14__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON14__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON14__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON14__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON14__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON14__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON14__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON14__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON14__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON14__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON14__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON14__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA14" offset="0x3f0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA14" offset="0x400" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON15" offset="0x410" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON15__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON15__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON15__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON15__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON15__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON15__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON15__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON15__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON15__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON15__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON15__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON15__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON15__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON15__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON15__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA15" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA15" offset="0x430" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON16" offset="0x440" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON16__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON16__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON16__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON16__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON16__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON16__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON16__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON16__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON16__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON16__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON16__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON16__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON16__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON16__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON16__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA16" offset="0x450" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA16" offset="0x460" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON17" offset="0x470" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON17__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON17__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON17__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON17__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON17__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON17__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON17__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON17__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON17__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON17__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON17__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON17__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON17__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON17__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON17__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA17" offset="0x480" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA17" offset="0x490" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
