Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="" name="CFD1FIFOSTA27" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA27" offset="0x670" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON28" offset="0x680" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON28__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON28__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON28__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON28__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON28__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON28__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON28__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON28__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON28__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON28__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON28__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON28__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON28__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON28__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON28__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA28" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA28" offset="0x6a0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON29" offset="0x6b0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON29__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON29__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON29__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON29__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON29__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON29__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON29__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON29__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON29__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON29__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON29__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON29__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON29__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON29__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON29__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA29" offset="0x6c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA29" offset="0x6d0" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Register" name="CFD1FIFOCON30" offset="0x6e0" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON30__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON30__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON30__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON30__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON30__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON30__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON30__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON30__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON30__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON30__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON30__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON30__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON30__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON30__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON30__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA30" offset="0x6f0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
         <register caption="" name="CFD1FIFOUA30" offset="0x700" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="FIFO Control Registe" name="CFD1FIFOCON31" offset="0x710" rw="RW" size="4">
            <bitfield caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" mask="0x00000001" name="TFNRFNIE" values="CFD1FIFOCON31__TFNRFNIE" />
            <bitfield caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" mask="0x00000002" name="TFHRFHIE" values="CFD1FIFOCON31__TFHRFHIE" />
            <bitfield caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" mask="0x00000004" name="TFERFFIE" values="CFD1FIFOCON31__TFERFFIE" />
            <bitfield caption="Overflow Interrupt Enable bit" mask="0x00000008" name="RXOVIE" values="CFD1FIFOCON31__RXOVIE" />
            <bitfield caption="Transmit Attempts Exhausted Interrupt Enable bit" mask="0x00000010" name="TXATIE" values="CFD1FIFOCON31__TXATIE" />
            <bitfield caption="Received Message Time Stamp Enable bit" mask="0x00000020" name="RXTSEN" values="CFD1FIFOCON31__RXTSEN" />
            <bitfield caption="Auto RTR Enable bit" mask="0x00000040" name="RTREN" values="CFD1FIFOCON31__RTREN" />
            <bitfield caption="TX / RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="CFD1FIFOCON31__TXEN" />
            <bitfield caption="Increment Head / Tail bit" mask="0x00000100" name="UINC" values="CFD1FIFOCON31__UINC" />
            <bitfield caption="Message Send Request bit" mask="0x00000200" name="TXREQ" values="CFD1FIFOCON31__TXREQ" />
            <bitfield caption="FIFO Reset bit" mask="0x00000400" name="FRESET" values="CFD1FIFOCON31__FRESET" />
            <bitfield caption="Message Transmit Priority bits (EXPANDED)" mask="0x001F0000" name="TXPRI" values="CFD1FIFOCON31__TXPRI" />
            <bitfield caption="Retransmission Attempts bits" mask="0x00600000" name="TXAT" values="CFD1FIFOCON31__TXAT" />
            <bitfield caption="FIFO Size bits" mask="0x1F000000" name="FSIZE" values="CFD1FIFOCON31__FSIZE" />
            <bitfield caption="Payload Size bits" mask="0xE0000000" name="PLSIZE" values="CFD1FIFOCON31__PLSIZE" />
         </register>
         <register caption="" name="CFD1FIFOSTA31" offset="0x720" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TFNRFNIF" />
            <bitfield mask="0x00000002" name="TFHRFHIF" />
            <bitfield mask="0x00000004" name="TFERFFIF" />
            <bitfield mask="0x00000008" name="RXOVIF" />
            <bitfield mask="0x00000010" name="TXATIF" />
            <bitfield mask="0x00000020" name="TXERR" />
            <bitfield mask="0x00000040" name="TXLARB" />
            <bitfield mask="0x00000080" name="TXABT" />
            <bitfield mask="0x00001F00" name="FIFOCI" />
         </register>
