Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="Filter Control Register" name="CFD1FLTCON7" offset="0x7b0" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F28BP" values="CFD1FLTCON7__F28BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN28" values="CFD1FLTCON7__FLTEN28" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F29BP" values="CFD1FLTCON7__F29BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN29" values="CFD1FLTCON7__FLTEN29" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F30BP" values="CFD1FLTCON7__F30BP" />
            <bitfield caption="Enable Filter nto Accept Messages bits" mask="0x00800000" name="FLTEN30" values="CFD1FLTCON7__FLTEN30" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F31BP" values="CFD1FLTCON7__F31BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN31" values="CFD1FLTCON7__FLTEN31" />
         </register>
         <register caption="" name="CFD1FLTOBJ0" offset="0x7c0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ0__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ0__EXIDE" />
         </register>
         <register caption="" name="CFD1MASK0" offset="0x7d0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK0__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK0__MIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1FLTOBJ1" offset="0x7e0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ1__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ1__EXIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1MASK1" offset="0x7f0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK1__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK1__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ2" offset="0x800" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ2__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ2__EXIDE" />
         </register>
         <register caption="" name="CFD1MASK2" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK2__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK2__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ3" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ3__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ3__EXIDE" />
         </register>
         <register caption="" name="CFD1MASK3" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK3__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK3__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ4" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ4__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ4__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK4" offset="0x850" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK4__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK4__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ5" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ5__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ5__EXIDE" />
         </register>
