Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Device Net Filter Bit Number bits" name="CFD1CON__DNCNT">
         <value caption="Invalid Selection (compare with EID)" name="" value="11111-10011" />
         <value caption="Compare up to data byte 0(7-0) and Byte 1(7-0) and Byte 2(6) with EID17" name="" value="0x12" />
         <value caption="Compare up to data byte 0(7-0) and Byte 1(7-0) and Byte 2(7) with EID(0-16)" name="" value="0x11" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-0) with EID(0-15)" name="" value="0x10" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-1) with EID(0-14)" name="" value="0xf" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-2) with EID(0-13)" name="" value="0xe" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-3) with EID(0-12)" name="" value="0xd" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-4) with EID(0-11)" name="" value="0xc" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-5) with EID(0-10)" name="" value="0xb" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7-6) with EID(0-9)" name="" value="0xa" />
         <value caption="Compare up to data byte 0(7-0) and data byte 1(7) with EID(0-8)" name="" value="0x9" />
         <value caption="Compare up to data byte 0(7-0) with EID(0-7)" name="" value="0x8" />
         <value caption="Compare up to data byte 0(7-1) with EID(0-6)" name="" value="0x7" />
         <value caption="Compare up to data byte 0(7-2) with EID(0-5)" name="" value="0x6" />
         <value caption="Compare up to data byte 0(7-3) with EID(0-4)" name="" value="0x5" />
         <value caption="Compare up to data byte 0(7-4) with EID(0-3)" name="" value="0x4" />
         <value caption="Compare up to data byte 0(7-5) with EID(0-2)" name="" value="0x3" />
         <value caption="Compare up to data byte 0(7-6) with EID(0-1)" name="" value="0x2" />
         <value caption="Compare up to data byte 0 bit 7 with EID0" name="" value="0x1" />
         <value caption="Do not compare data bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable ISO CRC in CAN FD Frames bit" name="CFD1CON__ISOCRCEN">
         <value caption="Include Stuff Bit Count in CRC Field and use Non-Zero CRC Initialization Vector" name="" value="0x1" />
         <value caption="Do not include Stuff Bit Count in CRC Field and use CRC Initialization Vector with all zeros" name="" value="0x0" />
      </value-group>
      <value-group caption="Protocol Exception Event Detection Disabled bit" name="CFD1CON__PXEDIS">
         <value caption="Protocol Exception is treated as a Form Error." name="" value="0x1" />
         <value caption="If a Protocol Exception is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Module Clock Source Select bit" name="CFD1CON__CLKSEL0">
         <value caption="REFCLK4 is active when the CAN FD module is enabled" name="" value="0x1" />
         <value caption="SYSCLK is active when the CAN FD module is enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable CAN Bus Line Wake-up Filter bit" name="CFD1CON__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1" />
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0" />
      </value-group>
      <value-group caption="Selectable Wake-up Filter Time bits" name="CFD1CON__WFT">
         <value caption="T11FILTER (Typical 600 ns)" name="" value="0x3" />
         <value caption="T10FILTER (Typical 375 ns)" name="" value="0x2" />
         <value caption="T01FILTER (Typical 187 ns)" name="" value="0x1" />
         <value caption="T00FILTER (Typical 100 ns)" name="" value="0x0" />
      </value-group>
      <value-group caption="CAN Module is Busy bit" name="CFD1CON__BUSY">
         <value caption="The CAN module is active" name="" value="0x1" />
         <value caption="The CAN module is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Bit Rate Switching Disable bit" name="CFD1CON__BRSDIS">
         <value caption="Bit Rate Switching is Disabled" name="" value="0x1" />
         <value caption="Bit Rate Switching depends on BRS in the Transmit Message Object" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop-in-Idle Control bit" name="CFD1CON__SIDL">
         <value caption="Stop module operation in Idle mode" name="" value="0x1" />
         <value caption="Dont stop module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable bit" name="CFD1CON__ON">
         <value caption="CAN module is enabled" name="" value="0x1" />
         <value caption="CAN module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Restrict Retransmission Attempts bit" name="CFD1CON__RTXAT">
         <value caption="Restricted retransmission attempts" name="" value="0x1" />
         <value caption="Unlimited number of retransmission attempts" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit ESI in Gateway Mode bit" name="CFD1CON__ESIGM">
         <value caption="ESI is transmitted as recessive when ESI of message is high or CAN controller error passive" name="" value="0x1" />
         <value caption="ESI reflects error status of CAN controller" name="" value="0x0" />
      </value-group>
      <value-group caption="Transition to Listen Only Mode on System Error bit" name="CFD1CON__SERR2LOM">
         <value caption="Transition to Listen Only Mode" name="" value="0x1" />
         <value caption="Transition to Restricted Operation Mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Store in Transmit Event FIFO bit" name="CFD1CON__STEF">
         <value caption="Save transmitted messages in TEF" name="" value="0x1" />
         <value caption="Dont save transmitted messages in TEF" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Transmit Queue bit" name="CFD1CON__TXQEN">
         <value caption="Enables Transmit Queue and reserves space in RAM" name="" value="0x1" />
         <value caption="Dont reserve space in RAM for Transmit Queue" name="" value="0x0" />
      </value-group>
      <value-group caption="Operation Mode Status bits" name="CFD1CON__OPMOD">
         <value caption="Module is Restricted Operation mode" name="" value="0x7" />
         <value caption="Module is Normal CAN 2.0 mode; error frames on CAN FD frames" name="" value="0x6" />
         <value caption="Module is in External Loopback mode" name="" value="0x5" />
         <value caption="Module is in Configuration mode" name="" value="0x4" />
         <value caption="Module is in Listen Only mode" name="" value="0x3" />
         <value caption="Module is in Internal Loopback mode" name="" value="0x2" />
         <value caption="Module is in Disable mode" name="" value="0x1" />
         <value caption="Module is in Normal CAN FD mode; supports mixing of Full CAN FD and Classic CAN 2.0 frames" name="" value="0x0" />
      </value-group>
