Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK4__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ5__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ5__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK5__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK5__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ6__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ6__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK6__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK6__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ7__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ7__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK7__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK7__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ8__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ8__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK8__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK8__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ9__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ9__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK9__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK9__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ10__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ10__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK10__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK10__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ11__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
