Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="Comparator x Mask Control Register" name="CM1MSKCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM1MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM1MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM1MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM1MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM1MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM1MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM1MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM1MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM1MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM1MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM1MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM1MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM1MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM1MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM1MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM1MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM1MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM1MSKCON__SELSRCC" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM2MSKCON" offset="0x40" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM2MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM2MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM2MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM2MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM2MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM2MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM2MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM2MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM2MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM2MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM2MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM2MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM2MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM2MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM2MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM2MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM2MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM2MSKCON__SELSRCC" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM3MSKCON" offset="0x60" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM3MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM3MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM3MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM3MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM3MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM3MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM3MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM3MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM3MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM3MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM3MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM3MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM3MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM3MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM3MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM3MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM3MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM3MSKCON__SELSRCC" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM4MSKCON" offset="0x80" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM4MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM4MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM4MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM4MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM4MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM4MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM4MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM4MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM4MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM4MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM4MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM4MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM4MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM4MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM4MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM4MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM4MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM4MSKCON__SELSRCC" />
         </register>
         <register caption="Comparator x Mask Control Register" name="CM5MSKCON" offset="0xa0" rw="RW" size="4">
            <bitfield caption="AND Gate A Inverted Input Enable bit" mask="0x00000001" name="AANEN" values="CM5MSKCON__AANEN" />
            <bitfield caption="AND Gate A Input Enable bit" mask="0x00000002" name="AAEN" values="CM5MSKCON__AAEN" />
            <bitfield caption="AND Gate B Inverted Input Enable bit" mask="0x00000004" name="ABNEN" values="CM5MSKCON__ABNEN" />
            <bitfield caption="AND Gate B Input Enable bit" mask="0x00000008" name="ABEN" values="CM5MSKCON__ABEN" />
            <bitfield caption="AND Gate C Inverted Input Enable bit" mask="0x00000010" name="ACNEN" values="CM5MSKCON__ACNEN" />
            <bitfield caption="AND Gate C Input Enable bit" mask="0x00000020" name="ACEN" values="CM5MSKCON__ACEN" />
            <bitfield caption="Positive AND Gate Output Select bit" mask="0x00000040" name="PAGS" values="CM5MSKCON__PAGS" />
            <bitfield caption="Negative AND Gate Output Select bit" mask="0x00000080" name="NAGS" values="CM5MSKCON__NAGS" />
            <bitfield caption="OR Gate A Input Inverted Enable bit" mask="0x00000100" name="OANEN" values="CM5MSKCON__OANEN" />
            <bitfield caption="OR Gate A Input Enable bit" mask="0x00000200" name="OAEN" values="CM5MSKCON__OAEN" />
            <bitfield caption="OR Gate B Input Inverted Enable bit" mask="0x00000400" name="OBNEN" values="CM5MSKCON__OBNEN" />
            <bitfield caption="OR Gate B Input Enable bit" mask="0x00000800" name="OBEN" values="CM5MSKCON__OBEN" />
            <bitfield caption="OR Gate C Input Inverted Enable bit" mask="0x00001000" name="OCNEN" values="CM5MSKCON__OCNEN" />
            <bitfield caption="OR Gate C Input Enable bit" mask="0x00002000" name="OCEN" values="CM5MSKCON__OCEN" />
            <bitfield caption="High or Low Level Masking Select bit" mask="0x00008000" name="HLMS" values="CM5MSKCON__HLMS" />
            <bitfield caption="Mask A Input Select bits" mask="0x000F0000" name="SELSRCA" values="CM5MSKCON__SELSRCA" />
            <bitfield caption="Mask B Input Select bits" mask="0x00F00000" name="SELSRCB" values="CM5MSKCON__SELSRCB" />
            <bitfield caption="Mask C Input Select bits" mask="0x0F000000" name="SELSRCC" values="CM5MSKCON__SELSRCC" />
         </register>
      </register-group>
      <value-group caption="Op amp/Comparator 1 Output Status bit" name="CMSTAT__C1OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
      <value-group caption="Op amp/Comparator 2 Output Status bit" name="CMSTAT__C2OUT">
         <value caption="(When CPOL is 0) Vin+ greater than Vth+ / (When CPOL is 1) VIN+  Vth+ / (When CPOL is 1) VIN+ less than VTH-" name="" value="0x1" />
         <value caption="(When CPOL is 0) Vin+  Vth+" name="" value="0x0" />
      </value-group>
