Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Op amp Enable bit" name="CM5CON__OPAON">
         <value caption="Op amp enabled and connected to pin" name="" value="0x1" />
         <value caption="Op amp disabled and pin is released to other functions" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Inverted Input Enable bit" name="CM1MSKCON__AANEN">
         <value caption="A input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Input Enable bit" name="CM1MSKCON__AAEN">
         <value caption="A input enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate B Inverted Input Enable bit" name="CM1MSKCON__ABNEN">
         <value caption="B input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="B input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate B Input Enable bit" name="CM1MSKCON__ABEN">
         <value caption="B input enabled as input to AND gate" name="" value="0x1" />
         <value caption="B input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate C Inverted Input Enable bit" name="CM1MSKCON__ACNEN">
         <value caption="C input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="C input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate C Input Enable bit" name="CM1MSKCON__ACEN">
         <value caption="C input enabled as input to AND gate" name="" value="0x1" />
         <value caption="C input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="Positive AND Gate Output Select bit" name="CM1MSKCON__PAGS">
         <value caption="The positive output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The positive output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Negative AND Gate Output Select bit" name="CM1MSKCON__NAGS">
         <value caption="The negative (inverted) output of the AND gate to the OR gate is enabled" name="" value="0x1" />
         <value caption="The negative (inverted) output of the AND gate to the OR gate is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate A Input Inverted Enable bit" name="CM1MSKCON__OANEN">
         <value caption="A input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="A input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate A Input Enable bit" name="CM1MSKCON__OAEN">
         <value caption="A input enabled as input to OR gate" name="" value="0x1" />
         <value caption="A input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate B Input Inverted Enable bit" name="CM1MSKCON__OBNEN">
         <value caption="B input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="B input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate B Input Enable bit" name="CM1MSKCON__OBEN">
         <value caption="B input enabled as input to OR gate" name="" value="0x1" />
         <value caption="B input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate C Input Inverted Enable bit" name="CM1MSKCON__OCNEN">
         <value caption="C input (inverted) enabled as input to OR gate" name="" value="0x1" />
         <value caption="C input (inverted) disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="OR Gate C Input Enable bit" name="CM1MSKCON__OCEN">
         <value caption="C input enabled as input to OR gate" name="" value="0x1" />
         <value caption="C input disabled as input to OR gate" name="" value="0x0" />
      </value-group>
      <value-group caption="High or Low Level Masking Select bit" name="CM1MSKCON__HLMS">
         <value caption="The comparator deasserted state is 1" name="" value="0x1" />
         <value caption="The comparator deasserted state is 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Mask A Input Select bits" name="CM1MSKCON__SELSRCA">
         <value caption="FLT4 pin" name="" value="0xf" />
         <value caption="FLT2 pin" name="" value="0xe" />
         <value caption="PWM5L" name="" value="0xd" />
         <value caption="PWM4L" name="" value="0xc" />
         <value caption="PWM3L" name="" value="0xb" />
         <value caption="PWM2L" name="" value="0xa" />
         <value caption="PWM1L" name="" value="0x9" />
         <value caption="PWM9H" name="" value="0x8" />
         <value caption="PWM8H" name="" value="0x7" />
         <value caption="PWM7H" name="" value="0x6" />
         <value caption="PWM6H" name="" value="0x5" />
         <value caption="PWM5H" name="" value="0x4" />
         <value caption="PWM4H" name="" value="0x3" />
         <value caption="PWM3H" name="" value="0x2" />
         <value caption="PWM2H" name="" value="0x1" />
         <value caption="PWM1H" name="" value="0x0" />
      </value-group>
      <value-group caption="Mask B Input Select bits" name="CM1MSKCON__SELSRCB">
         <value caption="FLT4 pin" name="" value="0xf" />
         <value caption="FLT2 pin" name="" value="0xe" />
         <value caption="PWM5L" name="" value="0xd" />
         <value caption="PWM4L" name="" value="0xc" />
         <value caption="PWM3L" name="" value="0xb" />
         <value caption="PWM2L" name="" value="0xa" />
         <value caption="PWM1L" name="" value="0x9" />
         <value caption="PWM9H" name="" value="0x8" />
         <value caption="PWM8H" name="" value="0x7" />
         <value caption="PWM7H" name="" value="0x6" />
         <value caption="PWM6H" name="" value="0x5" />
         <value caption="PWM5H" name="" value="0x4" />
         <value caption="PWM4H" name="" value="0x3" />
         <value caption="PWM3H" name="" value="0x2" />
         <value caption="PWM2H" name="" value="0x1" />
         <value caption="PWM1H" name="" value="0x0" />
      </value-group>
      <value-group caption="Mask C Input Select bits" name="CM1MSKCON__SELSRCC">
         <value caption="FLT4 pin" name="" value="0xf" />
         <value caption="FLT2 pin" name="" value="0xe" />
         <value caption="PWM5L" name="" value="0xd" />
         <value caption="PWM4L" name="" value="0xc" />
         <value caption="PWM3L" name="" value="0xb" />
         <value caption="PWM2L" name="" value="0xa" />
         <value caption="PWM1L" name="" value="0x9" />
         <value caption="PWM9H" name="" value="0x8" />
         <value caption="PWM8H" name="" value="0x7" />
         <value caption="PWM7H" name="" value="0x6" />
         <value caption="PWM6H" name="" value="0x5" />
         <value caption="PWM5H" name="" value="0x4" />
         <value caption="PWM4H" name="" value="0x3" />
         <value caption="PWM3H" name="" value="0x2" />
         <value caption="PWM2H" name="" value="0x1" />
         <value caption="PWM1H" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Inverted Input Enable bit" name="CM2MSKCON__AANEN">
         <value caption="A input (inverted) enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input (inverted) disabled as input to AND gate" name="" value="0x0" />
      </value-group>
      <value-group caption="AND Gate A Input Enable bit" name="CM2MSKCON__AAEN">
         <value caption="A input enabled as input to AND gate" name="" value="0x1" />
         <value caption="A input disabled as input to AND gate" name="" value="0x0" />
      </value-group>
