Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="" name="IPC21" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T8IS" />
            <bitfield mask="0x0000001C" name="T8IP" />
            <bitfield mask="0x00000300" name="IC8EIS" />
            <bitfield mask="0x00001C00" name="IC8EIP" />
            <bitfield mask="0x00030000" name="IC8IS" />
            <bitfield mask="0x001C0000" name="IC8IP" />
            <bitfield mask="0x03000000" name="OC8IS" />
            <bitfield mask="0x1C000000" name="OC8IP" />
         </register>
         <register caption="" name="IPC22" offset="0x2A0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T9IS" />
            <bitfield mask="0x0000001C" name="T9IP" />
            <bitfield mask="0x00000300" name="IC9EIS" />
            <bitfield mask="0x00001C00" name="IC9EIP" />
            <bitfield mask="0x00030000" name="IC9IS" />
            <bitfield mask="0x001C0000" name="IC9IP" />
            <bitfield mask="0x03000000" name="OC9IS" />
            <bitfield mask="0x1C000000" name="OC9IP" />
         </register>
         <register caption="" name="IPC23" offset="0x2B0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1IS" />
            <bitfield mask="0x0000001C" name="AD1IP" />
            <bitfield mask="0x00030000" name="AD1DC1IS" />
            <bitfield mask="0x001C0000" name="AD1DC1IP" />
            <bitfield mask="0x03000000" name="AD1DC2IS" />
            <bitfield mask="0x1C000000" name="AD1DC2IP" />
         </register>
         <register caption="" name="IPC24" offset="0x2C0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1DF1IS" />
            <bitfield mask="0x0000001C" name="AD1DF1IP" />
            <bitfield mask="0x00000300" name="AD1DF2IS" />
            <bitfield mask="0x00001C00" name="AD1DF2IP" />
            <bitfield mask="0x00030000" name="AD1DF3IS" />
            <bitfield mask="0x001C0000" name="AD1DF3IP" />
            <bitfield mask="0x03000000" name="AD1DF4IS" />
            <bitfield mask="0x1C000000" name="AD1DF4IP" />
         </register>
         <register caption="" name="IPC25" offset="0x2D0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1F1IS" />
            <bitfield mask="0x0000001C" name="AD1F1IP" />
            <bitfield mask="0x00000300" name="AD1EOSIS" />
            <bitfield mask="0x00001C00" name="AD1EOSIP" />
            <bitfield mask="0x00030000" name="AD1ARIS" />
            <bitfield mask="0x001C0000" name="AD1ARIP" />
            <bitfield mask="0x03000000" name="AD1RSIS" />
            <bitfield mask="0x1C000000" name="AD1RSIP" />
         </register>
         <register caption="" name="IPC26" offset="0x2E0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1FCBTIS" />
            <bitfield mask="0x0000001C" name="AD1FCBTIP" />
            <bitfield mask="0x00000300" name="AD1G1IS" />
            <bitfield mask="0x00001C00" name="AD1G1IP" />
            <bitfield mask="0x00030000" name="AD1D0IS" />
            <bitfield mask="0x001C0000" name="AD1D0IP" />
            <bitfield mask="0x03000000" name="AD1D1IS" />
            <bitfield mask="0x1C000000" name="AD1D1IP" />
         </register>
         <register caption="" name="IPC27" offset="0x2F0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D2IS" />
            <bitfield mask="0x0000001C" name="AD1D2IP" />
            <bitfield mask="0x00000300" name="AD1D3IS" />
            <bitfield mask="0x00001C00" name="AD1D3IP" />
            <bitfield mask="0x00030000" name="AD1D4IS" />
            <bitfield mask="0x001C0000" name="AD1D4IP" />
            <bitfield mask="0x03000000" name="AD1D5IS" />
            <bitfield mask="0x1C000000" name="AD1D5IP" />
         </register>
         <register caption="" name="IPC28" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D6IS" />
            <bitfield mask="0x0000001C" name="AD1D6IP" />
            <bitfield mask="0x00000300" name="AD1D7IS" />
            <bitfield mask="0x00001C00" name="AD1D7IP" />
            <bitfield mask="0x00030000" name="AD1D8IS" />
            <bitfield mask="0x001C0000" name="AD1D8IP" />
            <bitfield mask="0x03000000" name="AD1D9IS" />
            <bitfield mask="0x1C000000" name="AD1D9IP" />
         </register>
         <register caption="" name="IPC29" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D10IS" />
            <bitfield mask="0x0000001C" name="AD1D10IP" />
            <bitfield mask="0x00000300" name="AD1D11IS" />
            <bitfield mask="0x00001C00" name="AD1D11IP" />
            <bitfield mask="0x00030000" name="AD1D12IS" />
            <bitfield mask="0x001C0000" name="AD1D12IP" />
            <bitfield mask="0x03000000" name="AD1D13IS" />
            <bitfield mask="0x1C000000" name="AD1D13IP" />
         </register>
         <register caption="" name="IPC30" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D14IS" />
            <bitfield mask="0x0000001C" name="AD1D14IP" />
            <bitfield mask="0x00000300" name="AD1D15IS" />
            <bitfield mask="0x00001C00" name="AD1D15IP" />
            <bitfield mask="0x00030000" name="AD1D16IS" />
            <bitfield mask="0x001C0000" name="AD1D16IP" />
            <bitfield mask="0x03000000" name="AD1D17IS" />
            <bitfield mask="0x1C000000" name="AD1D17IP" />
         </register>
         <register caption="" name="IPC31" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D18IS" />
            <bitfield mask="0x0000001C" name="AD1D18IP" />
            <bitfield mask="0x00000300" name="AD1D19IS" />
            <bitfield mask="0x00001C00" name="AD1D19IP" />
         </register>
         <register caption="" name="IPC32" offset="0x340" rw="RW" size="4">
            <bitfield mask="0x00030000" name="AD1D24IS" />
            <bitfield mask="0x001C0000" name="AD1D24IP" />
            <bitfield mask="0x03000000" name="AD1D25IS" />
            <bitfield mask="0x1C000000" name="AD1D25IP" />
         </register>
         <register caption="" name="IPC33" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x00000003" name="AD1D26IS" />
            <bitfield mask="0x0000001C" name="AD1D26IP" />
            <bitfield mask="0x00000300" name="AD1D27IS" />
            <bitfield mask="0x00001C00" name="AD1D27IP" />
         </register>
         <register caption="" name="IPC34" offset="0x360" rw="RW" size="4"/>
