Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY4" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY5" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY6" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY7" offset="0x790" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY8" offset="0x890" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY9" offset="0x990" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON1" offset="0x1a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON1__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON1__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON1__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON2" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON2__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON2__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON2__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON3" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON3__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON3__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON3__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON4" offset="0x4a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON4__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON4__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON4__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON5" offset="0x5a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON5__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON5__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON5__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON6" offset="0x6a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON6__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON6__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON6__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON7" offset="0x7a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON7__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON7__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON7__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON8" offset="0x8a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON8__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON8__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON8__CHOPSEL" />
         </register>
         <register caption="PWM Auxiliary Control Register x (x = 1 through 12)" name="AUXCON9" offset="0x9a0" rw="RW" size="4">
            <bitfield caption="PWMxL Output Chopping Enable bit" mask="0x00000001" name="CHOPLEN" values="AUXCON9__CHOPLEN" />
            <bitfield caption="PWMxH Output Chopping Enable bit" mask="0x00000002" name="CHOPHEN" values="AUXCON9__CHOPHEN" />
            <bitfield caption="PWM Chop Clock Source Select bits" mask="0x0000003C" name="CHOPSEL" values="AUXCON9__CHOPSEL" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR1" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR2" offset="0x2b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
         <register caption="PWM Timer Register x (x = 1 through 12)" name="PTMR3" offset="0x3b0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="TMR" />
         </register>
