Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.10.146/atdf/PIC32MK0512MCJ064.atdf
      <value-group caption="Fault Input Leading-Edge Blanking Enable bit" name="LEBCON9__FLTLEBEN">
         <value caption="Leading-Edge Blanking is applied to selected fault input" name="" value="0x1" />
         <value caption="Leading-Edge Blanking is not applied to selected fault input" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Falling Edge Trigger Enable bit" name="LEBCON9__PLF">
         <value caption="Falling edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Rising Edge Trigger Enable bit" name="LEBCON9__PLR">
         <value caption="Rising edge of PWMxL will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxL will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Falling Edge Trigger Enable bit" name="LEBCON9__PHF">
         <value caption="Falling edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Falling edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Rising Edge Trigger Enable bit" name="LEBCON9__PHR">
         <value caption="Rising edge of PWMxH will trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x1" />
         <value caption="Rising edge of PWMxH will not trigger/retrigger the Leading-Edge Blanking counter" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON1__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON1__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON1__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON2__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON2__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON2__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON3__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON3__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON3__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
